<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
body {
	background-image: url(WALLPAPER-6-3.jpg);
}
body,td,th {
	color: #F0F0F0;
	font-family: Courier New, Courier, monospace;
	font-size: 18px;
}
.style1 {font-family: Georgia, "Times New Roman", Times, serif}
.style2 {
	font-family: Georgia, "Times New Roman", Times, serif;
	color: #FFFFFF;
	font-weight: bold;
	font-size: 24px;
}
.style3 {font-family: Georgia, "Times New Roman", Times, serif; font-size: 24px; }
.style5 {font-family: Georgia, "Times New Roman", Times, serif; font-size: 24; }
-->
</style></head>

<body>
<table width="1240" height="723" border="1">
  <tr>
    <td width="1230"><p>El&nbsp;<strong>desarrollo de videojuegos</strong>&nbsp;es el proceso &nbsp;de creaci&oacute;n de un videojuegos, desde el concepto inicial hasta el videojuego en su versi&oacute;n final. Es una actividad multidisciplinaria, que involucra profesionales de la programaci&oacute;n, dise&ntilde;o grafico,animacion, sonido, musica, actuacion, etc.</p>
      <h2 align="center" class="style2"><span id="Desarrollo">Desarrollo</span></h2>
      <p align="center">&nbsp;</p>
      <p>El desarrollo se lleva a cabo por un desarrollo de videojuegos, que puede variar de una persona a un gran negocio. Los videojuegos comerciales para PC &nbsp;y videoconsolas son normalmente financiados por una distribuidora &nbsp;y tardan varios a&ntilde;os en desarrollarse. Los videojuegos independientes &nbsp;pueden tomar menos tiempo y pueden ser producidos a bajo precio por individuos y peque&ntilde;os desarrolladores. La industria de videojuegos independientes ha visto un aumento en los &uacute;ltimos a&ntilde;os con el crecimiento de los nuevos sistemas de distribucion en linea y el mercado de juegos para m&oacute;viles.</p>
      <p>Los primeros videojuegos fueron desarrollados en la d&eacute;cada de 1960, pero requer&iacute;an grandes ordenadores y no estaban disponibles para el p&uacute;blico en general. El desarrollo del videojuego comercial comenz&oacute; en 1970 con la llegada de la primera generaci&oacute;n de consolas de videojuegos y ordenadores dom&eacute;sticos. Debido a los altos costos y bajas capacidades de las computadoras, un programador solitario podr&iacute;a desarrollar un juego completo. Sin embargo, acercase &nbsp;el siglo 21, el cada vez mayor poder de procesamiento y las aumentadas expectativas del consumidor hicieron que sea dif&iacute;cil que un &uacute;nico programador &nbsp;produzca un videojuego para ordenador o videoconsola. El precio promedio de la producci&oacute;n de un videojuego lentamente aument&oacute; de $1-2 dolares &nbsp;en 2000 a m&aacute;s de $3 en 2005, y luego a m&aacute;s de $4 en 2010. Sin embargo, los videojuegos independientes para m&oacute;viles, o basados en la web pueden costar mucho menos.</p>
      <h2 align="center" class="style3"><span id="Proceso">Proceso</span></h2>
      <p align="center">&nbsp;</p>
      <p>Para que el creador haga esto en el desarrollo de un videojuego generalmente hace el siguiente proceso:</p>
      <ul>
        <li>Concepci&oacute;n de la idea &nbsp;del videojuego</li>
        <li>Dise&ntilde;o</li>
        <li>Planificaci&oacute;n</li>
        <li>Preproducci&oacute;n</li>
        <li>Producci&oacute;n</li>
        <li>Pruebas</li>
        <li>Mantenimiento</li>
      </ul>
      <p>El proceso es similar a la creaci&oacute;n de software &nbsp;en general, aunque difiere en la gran cantidad de aportes creativos (m&uacute;sica, historia, dise&ntilde;o de personajes, niveles, etc) necesarios. El desarrollo tambi&eacute;n var&iacute;a en funci&oacute;n de la plataforma objetivo (PC, m&oacute;viles, consolas), el g&eacute;nero (estrategia en tiempo real, RPG, aventura grafica, plataformas, etc) y la forma de visualizaci&oacute;n (2D o 3D).</p>
      <p>Cabe mencionar que el dise&ntilde;os de juegos es usualmente considerado un proceso de creaci&oacute;n iterativo, esto quiere decir que los dise&ntilde;adores tendr&aacute;n que pasar por cada uno de estos pasos repetidas veces (cambiando y mejorando aspectos) hasta que consideren que el resultado sea el mejor.</p>
      <h3 align="center"> <span class="style5" id="Concepci&oacute;n">Concepci&oacute;n</span></h3>
      <p align="center">&nbsp;</p>
      <p>Al tener una idea inicial en mente comienza esta etapa en la cual deber&aacute;n plantear los aspectos fundamentales que conformar&aacute;n el videojuego, entre los que se encuentran:</p>
      <ul>
        <li>G&eacute;nero: dentro de qu&eacute; g&eacute;neros se va a desarrollar el juego. De no corresponder a un g&eacute;nero muy conocido, se deben especificar las caracter&iacute;sticas.</li>
        <li>Gameplay: lo que generar&aacute; diversi&oacute;n a la hora de jugarlo.</li>
        <li>Conceptos: algunas ideas sueltas acerca de c&oacute;mo debe lucir el juego en cuanto a personajes, ambientaci&oacute;n, m&uacute;sica, etc.</li>
      </ul>
      <p>Para el desarrollo de estos y para facilitar su creaci&oacute;n se pueden utilizar m&eacute;todos de pensamiento activo o lluvias de ideas, ya que es la etapa inicial, o conceptualizaci&oacute;n. Pueden usar t&eacute;cnicas simples como red o burbuja de palabras.</p>
      <h3 align="center"> <span class="style5" id="Dise&ntilde;o">Dise&ntilde;o</span></h3>
      <p align="center">&nbsp;</p>
      <p>En esta fase se detallan todos los elementos que compondr&aacute;n el juego, dando una idea clara a todos los miembros del grupo desarrollador acerca de c&oacute;mo son. Entre estos elementos tenemos:</p>
      <ul>
        <li>Historia: forma en que se desenvolver&aacute;n los personajes del juego y la historia del mundo (o un planeta en espec&iacute;fico) representado. Casi todos los juegos tienen historia.</li>
      </ul>
      <ul>
        <li>Guion: el proceso comienza con una reuni&oacute;n de todo el equipo de desarrollo, para que todo el equipo tenga la oportunidad de aportar sus ideas o sugerencias al proyecto. A partir de aqu&iacute; el equipo de guion trabaja por conseguir un borrador en el que queden plasmados cuales ser&aacute;n los objetivos en el juego, las partes en las que se dividir&aacute;, el contexto en el que se desarrollar&aacute; la acci&oacute;n, cuales y c&oacute;mo ser&aacute;n los personajes principales del juego, etc.</li>
      </ul>
      <ul>
        <li>Arte conceptual: se establece el aspecto general del juego. En esta etapa un grupo de artistas se encargan de visualizar o conceptualizar los personajes, escenarios, criaturas, objetos, etc. Estos artistas se basan en las ideas originales de los creadores y luego entregan una serie de propuestas impresas o digitales de c&oacute;mo lucir&aacute; el juego. Posteriormente, el director de arte se encargar&aacute; de escoger de entre las opciones aquellas que se apeguen m&aacute;s a la idea original. Algunas veces los artistas conceptuales permanecen durante todo el proceso de producci&oacute;n, pero lo usual es que s&oacute;lo participen en las primeras etapas del proceso.</li>
      </ul>
      <ul>
        <li>Sonido: detallada descripci&oacute;n de todos los elementos sonoros que el juego necesita para su realizaci&oacute;n. Voces, sonidos ambientales, efectos sonoros y m&uacute;sica.</li>
      </ul>
      <ul>
        <li>Mec&aacute;nica de juego: es la especificaci&oacute;n del funcionamiento general del juego. Es dependiente del g&eacute;nero y se&ntilde;ala la forma en que los diferentes entes virtuales interactuar&aacute;n dentro del juego, es decir, las reglas que rigen este.</li>
      </ul>
      <ul>
        <li>Dise&ntilde;o de programaci&oacute;n: describe la manera en que el videojuego ser&aacute; implementado en una m&aacute;quina real (PC, consola, m&oacute;viles, etc) mediante un cierto lengiaje de programacion &nbsp;y siguiendo una determinada metodolog&iacute;a. Generalmente en esta fase se generan diagramas de UMLque describen el funcionamiento est&aacute;tico y din&aacute;mico, la interacci&oacute;n con los usuarios y los diferentes estados que atravesar&aacute; el videojuego como software.</li>
      </ul>
      <p>De toda la fase de dise&ntilde;o es necesario generar un documento llamado&nbsp;<em>Documento de Dise&ntilde;o</em>, que contiene todas las especificaciones de arte, mec&aacute;nicas y programaci&oacute;n.</p>
      <h3 align="center"> <span class="style1" id="Planificaci&oacute;n">Planificaci&oacute;n</span></h3>
      <p align="center">&nbsp;</p>
      <p>En esta fase se identifican las tareas necesarias para la ejecuci&oacute;n del videojuego y se reparten entre los distintos componentes del equipo desarrollador. Tambi&eacute;n se fijan plazos para la ejecuci&oacute;n de dichas tareas y reuniones clave, con la ayuda de herramientas de diagramaci&oacute;n de actividades como GANTF &nbsp;y PERT.</p>
      <h3 align="center"> <span class="style1" id="Preproducci&oacute;n">Preproducci&oacute;n</span></h3>
      <p align="center">&nbsp;</p>
      <p>Durante la etapa de preproducci&oacute;n se le asigna el proyecto a un peque&ntilde;o equipo, con la finalidad de verificar la factibilidad de la idea.</p>
      <p>Este equipo trabajar&aacute; para crear un nivel o ambiente del juego, acerc&aacute;ndose lo m&aacute;s que se pueda al producto final. La preproducci&oacute;n es una de las partes m&aacute;s cr&iacute;ticas del proceso ya que determinar&aacute; la viabilidad del juego.</p>
      <h3 align="center"> <span class="style1" id="Producci&oacute;n">Producci&oacute;n</span></h3>
      <p align="center">&nbsp;</p>
      <p>Aqu&iacute; se llevan a cabo todas las tareas especificadas en la fase de planificaci&oacute;n, teniendo como gu&iacute;a fundamental el documento de dise&ntilde;o. Esto incluye, entre otras cosas, la codificaci&oacute;n del programa, la creaci&oacute;n de sprites, tiles y modelos 3D, grabaci&oacute;n de sonidos, voces y m&uacute;sica, creaci&oacute;n de herramientas para acelerar el proceso de desarrollo, entre otras.</p>
      <ul>
        <li>Programaci&oacute;n: la mayor&iacute;a de los juegos se programan utilizando el lenguaje C++ dado que es un lenguaje de nivel medio que permite un r&aacute;pido acceso a los componentes de hardware de una computadora o consola de juegos que lo hace m&aacute;s accesible.</li>
      </ul>
      <ul>
        <li>Ilustraci&oacute;n: los juegos 2D deben ser ilustrados por artistas experimentados, quienes trabajan tomando en consideraci&oacute;n las limitaciones t&eacute;cnicas del hardware sobre el cual correr&aacute; el juego, esto incluye: cantidad de colores disponibles, tama&ntilde;o de los sprites, resoluci&oacute;n final de los sprites y formatos a utilizar. Los artistas 2D tambi&eacute;n son los encargados de elaborar las animaciones del juego.</li>
      </ul>
      <ul>
        <li>Interfaz: es la forma en que se ver&aacute;n los elementos de la interfaz grafca de usuario &nbsp;y el HUD, mediante los cuales el usuario interactuar&aacute; con el juego.</li>
      </ul>
      <ul>
        <li>Animaci&oacute;n y modelado 3D: los artistas utilizan herramientas comerciales de modelado y animaci&oacute;n tridimensional como 3DS MAX, Maya, XSI/Softimage, Blender &nbsp;(el cual no es comercial), etc. Pero, adem&aacute;s, usan herramientas desarrolladas internamente que facilitan algunas de las funciones m&aacute;s comunes del proceso de creaci&oacute;n de juegos.</li>
      </ul>
      <ul>
        <li>Sonido: los ingenieros de sonido se encargan de crear sonidos para cada objeto o personaje del juego. Pueden crear sonidos desde cero o utilizar sonidos del ambiente y modificarlos seg&uacute;n sus necesidades.</li>
      </ul>
      <h3 align="center" class="style1"><span id="Pruebas">Pruebas</span></h3>
      <p align="center">&nbsp;</p>
      <p>Al igual que en otros tipos de software, los videojuegos deben pasar en su desarrollo por una etapa donde se corrigen los errores inherentes al proceso de programaci&oacute;n y se asegura su funcionalidad. Adem&aacute;s, a diferencia de aquellos, los videojuegos requieren un refinamiento de su caracter&iacute;stica fundamental, la de producir diversi&oacute;n de manera interactiva (jugabilidad). Generalmente, esta etapa se lleva a cabo en tres fases:</p>
      <ul>
        <li><strong>Pruebas f&iacute;sicas</strong>: se llevan a cabo por los dise&ntilde;adores y programadores del juego. Se crean prototipos que simulan los eventos que pueden suceder en el juego. Un prototipo f&iacute;sico puede utilizar papel y l&aacute;piz, tarjetas de &iacute;ndice, o incluso ser actuado fuera. Sobre la base de los resultados de estas pruebas se puede hacer una mejor aproximaci&oacute;n al balance del videojuego, pueden prevenir problemas de programaci&oacute;n. El objetivo es jugar y perfeccionar este simplista modelo antes de que un solo programador, productor o artista gr&aacute;fico est&eacute;n cada vez m&aacute;s introducidos en el proyecto. De esta manera, el dise&ntilde;ador del juego recibe retroalimentaci&oacute;n instant&aacute;nea en lo que piensan los jugadores del juego y pueden ver inmediatamente si est&aacute;n logrando su metas.</li>
      </ul>
      <ul>
        <li><strong>Pruebas alpha</strong>: se llevan a cabo por un peque&ntilde;o grupo de personas, que con anterioridad est&eacute;n involucradas en el desarrollo, lo que puede incluir artistas, programadores, coordinadores, etc. El prop&oacute;sito es corregir los defectos m&aacute;s graves y mejorar caracter&iacute;sticas de jugabilidad no contempladas en el documento de dise&ntilde;o.</li>
      </ul>
      <ul>
        <li> <strong>Pruebas beta</strong>: estas pruebas se llevan a cabo por un equipo externo de jugadores, bien sea que sean contratados para la ocasi&oacute;n o que sean un grupo componente del proyecto (grupo QA). De estas pruebas, el videojuego debe salir con la menor cantidad posible de defectos menores y ning&uacute;n defecto medio o cr&iacute;tico.</li>
      </ul>
      <h3 align="center" class="style1"><span id="Mantenimiento">Mantenimiento</span></h3>
      <p align="center">&nbsp;</p>
      <p>Una vez que el juego alcanza su versi&oacute;n final (RTM) y se publica, aparecer&aacute;n nuevos errores o se detectar&aacute;n posibles mejoras. Es necesario recopilar toda la informaci&oacute;n posible de los jugadores y a partir de ah&iacute; realizar los cambios oportunos para mejorar el juego en todos sus aspectos, ya sea de dise&ntilde;o, jugabilidad, etc. Estas correcciones o mejoras se hacen llegar a los usuarios en forma de parches o actualizaciones, que en ocasiones pueden incluir algunas caracter&iacute;sticas nuevas para el juego.</p>
      <p>En ocasiones, los desarrolladores van m&aacute;s all&aacute; -especialmente si el videojuego ha funcionado bien comercialmente- y realizan una ampliaci&oacute;n considerable en los contenidos o en las fases del videojuego que se pone a la venta normalmente a un precio inferior al del juego original y que se conoce como una expansi&oacute;n.</p></td>
  </tr>
</table>
</body>

</html>
