<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
body {
	background-image: url(Videojuegos_notas_Portada.jpg);
	background-color: #F0F0F0;
}
body,td,th {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 18px;
	color: #FFFFFF;
}
-->
</style></head>

<body>
<table width="1452" height="1286" border="1">
  <tr>
    <td width="513" height="1280"><p align="center">La historia de la programaci&oacute;n de los videojuegos se remonta a la d&eacute;cada de 1950, cuando se desarrollaron los primeros videojuegos simples como &quot;Tennis for Two&quot; y &quot;Spacewar!&quot;. Estos juegos fueron creados en computadoras muy primitivas y requer&iacute;an un conocimiento profundo de la programaci&oacute;n para poder ser desarrollados.</p>
      <p align="center">En la d&eacute;cada de 1970, con el surgimiento de las consolas de videojuegos como Atari y Nintendo, la programaci&oacute;n de videojuegos se convirti&oacute; en una industria en crecimiento. Los desarrolladores comenzaron a utilizar lenguajes de programaci&oacute;n m&aacute;s avanzados y gr&aacute;ficos mejorados para crear juegos m&aacute;s complejos y atractivos.</p>
      <p align="center">En los a&ntilde;os siguientes, la programaci&oacute;n de videojuegos evolucion&oacute; r&aacute;pidamente con el desarrollo de nuevas tecnolog&iacute;as como los gr&aacute;ficos en 3D, la realidad virtual y la inteligencia artificial. Los desarrolladores de videojuegos han tenido que adaptarse constantemente a los avances tecnol&oacute;gicos para seguir creando experiencias de juego innovadoras y emocionantes.</p>
      <p>&nbsp;</p>
    <table width="248" height="188" border="1" align="center" bordercolor="#33FFFF">
      <tr>
        <td width="238" height="182"><div align="center"><img src="videocomputersys.jpg" width="237" height="179" border="2" /></div></td>
      </tr>
    </table>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p align="center"><img src="giphy.gif" width="285" height="194" /></p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p></td>
    <td width="461"><p align="center">Hoy en d&iacute;a, la programaci&oacute;n de videojuegos es una industria multimillonaria con miles de desarrolladores trabajando en todo el mundo para crear juegos para una amplia variedad de plataformas, desde consolas de videojuegos hasta dispositivos m&oacute;viles y computadoras personales. La programaci&oacute;n de videojuegos sigue siendo un campo en constante evoluci&oacute;n, con nuevos avances tecnol&oacute;gicos y tendencias emergentes que moldean el futuro de la industria.</p>
    <p>&nbsp;</p>
    <table width="296" height="223" border="1" align="center" bordercolor="#000000">
      <tr>
        <td width="438" height="217"><img src="shift_large.gif" width="317" height="214" /></td>
      </tr>
    </table>
    <p align="center">&nbsp;</p>
    <p align="center"><strong>TENNIS FOR TWO </strong></p>
    <p align="center">El primer videojuego reconocido como tal es &quot;Tennis for Two&quot;, creado en 1958 por el f&iacute;sico William Higinbotham en el Laboratorio Nacional de Brookhaven, en Nueva York. Este juego era una simulaci&oacute;n de un partido de tenis en una pantalla de osciloscopio y permit&iacute;a a dos jugadores competir entre s&iacute; utilizando perillas para controlar la velocidad y la direcci&oacute;n de la pelota.</p>
    <p align="center"><img src="first-videogame-circa-1958-tennis-for-two.gif" width="291" height="190" /></p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p></td>
    <td width="456"><div align="center">
      <p><strong>SPACEWAR</strong></p>
      <p>Otro de los primeros videojuegos importantes fue &quot;Spacewar!&quot;, desarrollado en 1962 por Steve Russell y un grupo de estudiantes del Instituto Tecnol&oacute;gico de Massachusetts (MIT). Este juego permit&iacute;a a dos jugadores controlar naves espaciales y luchar entre s&iacute; en un campo gravitacional mientras evitaban ser absorbidos por un sol simulado.<img src="spacewar.gif" width="320" height="240" /></p>
      <p>Ambos juegos sentaron las bases para la industria de los videojuegos y marcaron el comienzo de una larga historia de innovaci&oacute;n y creatividad en el mundo de la programaci&oacute;n de videojuegos.</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p><img src="84a6cf6c95bd6eccdaba8bf1f7cefa80.gif" width="265" height="207" /></p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      </div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>

</html>
